app/views/shared/_sidebar.html.erb

	<% if is_enterprise? %>
	<a href="<%= (!current_user.company.present?) ? new_user_company_path(current_user.id) : edit_user_company_path(current_user.id,current_user.company.id) %>" class="item">
---
SELECT  "companies".* FROM "companies"  WHERE "companies"."user_id" = $1  ORDER BY "companies"."id" ASC LIMIT 1  [["user_id", 10]]

		</div>
		<a href="<%= (!current_user.resume.present?) ? new_resume_path : edit_resume_path(current_user.resume.id) %>" class="item">
---
SELECT  "resumes".* FROM "resumes"  WHERE "resumes"."user_id" = $1  ORDER BY "resumes"."id" ASC LIMIT 1  [["user_id", 8]]