app/controllers/companies_controller.rb

SELECT  "companies".* FROM "companies"  WHERE "companies"."id" = $1 LIMIT 1  [["id", 5]]
UPDATE "companies" SET "description" = $1, "updated_at" = $2 WHERE "companies"."id" = 5  [["description", "Minha empresa é foda :)"], ["updated_at", "2014-04-16 18:24:34.822083"]]
---
  def update
  	company = Company.find(params[:id])
    company.update_attributes(company_params)

INSERT INTO "companies" ("city", "created_at", "description", "name", "neighborhood", "section_work", "state", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
UPDATE "companies" SET "updated_at" = $1, "user_id" = $2 WHERE "companies"."id" = 2  [["updated_at", "2014-04-16 15:22:38.737523"], ["user_id", 10]]
---
  def create
  	company = Company.create(company_params)
    company.user = view_context.current_user
    company.save