app/controllers/experiences_controller.rb

SELECT  "experiences".* FROM "experiences"  WHERE "experiences"."id" = $1 LIMIT 1  [["id", 4]]
---
  def edit
    @experience = Experience.find(params[:id])

INSERT INTO "experiences" ("company_name", "created_at", "description", "location", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["company_name", "das"], ["created_at", "2014-04-15 21:36:44.885986"], ["description", "qw"], ["location", "asd"], ["title", "dsad"], ["updated_at", "2014-04-15 21:36:44.885986"]]
UPDATE "experiences" SET "resume_id" = $1, "updated_at" = $2 WHERE "experiences"."id" = 2  [["resume_id", 2], ["updated_at", "2014-04-15 20:06:00.280573"]]
---
  def create
    experience = Experience.create(experience_params)
    experience.resume = view_context.current_user.resume
    experience.save

SELECT  "experiences".* FROM "experiences"  WHERE "experiences"."id" = $1 LIMIT 1  [["id", 5]]
UPDATE "experiences" SET "title" = $1, "updated_at" = $2 WHERE "experiences"."id" = 5  [["title", "Instrutor de Informáticad"], ["updated_at", "2014-04-15 21:46:27.987338"]]
---
  def update
    experience = Experience.find(params[:id])
    experience.update_attributes(experience_params)

SELECT  "experiences".* FROM "experiences"  WHERE "experiences"."id" = $1 LIMIT 1  [["id", 6]]
DELETE FROM "experiences" WHERE "experiences"."id" = $1  [["id", 6]]
---
  def destroy
    experience = Experience.find(params[:id])
    experience.destroy