app/controllers/profiles_controller.rb

SELECT  "profiles".* FROM "profiles"  WHERE "profiles"."id" = $1 LIMIT 1  [["id", 1]]
---
  def edit
    if params[:id].to_i == view_context.current_user.profile.id
      @profile = Profile.find(params[:id])

SELECT  "profiles".* FROM "profiles"  WHERE "profiles"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "profiles" SET "city" = $1, "complement" = $2, "gender" = $3, "neighborhood" = $4, "state" = $5, "street" = $6, "updated_at" = $7, "website" = $8 WHERE "profiles"."id" = 1  [["city", ""], ["complement", ""], ["gender", "male"], ["neighborhood", ""], ["state", ""], ["street", ""], ["updated_at", "2014-04-10 17:22:33.637628"], ["website", ""]]
---
  def update
    @profile = Profile.find(params[:id])
    @profile.update_attributes(profile_params)