app/controllers/registrations_controller.rb

INSERT INTO "users" ("created_at", "email", "password", "recipe", "salt", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
INSERT INTO "profiles" ("created_at", "first_name", "last_name", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2014-04-08 18:13:54.560457"], ["first_name", "João"], ["last_name", "Teixeira"], ["updated_at", "2014-04-08 18:13:54.560457"], ["user_id", 4]]
---
  def create
    user = User.create(user_params)

    profile = Profile.new(profile_params)
    profile.user = user
    profile.save