app/controllers/resumes_controller.rb

  def edit
    @resume = Resume.find(view_context.current_user.resume.id)
---
SELECT  "resumes".* FROM "resumes"  WHERE "resumes"."user_id" = $1  ORDER BY "resumes"."id" ASC LIMIT 1  [["user_id", 8]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 8]]

  def create
    resume = Resume.create(resume_params)
    resume.user = view_context.current_user
    resume.save
---
INSERT INTO "resumes" ("created_at", "description", "is_public_link", "section_work", "show_in_search", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
UPDATE "resumes" SET "updated_at" = $1, "user_id" = $2 WHERE "resumes"."id" = 2  [["updated_at", "2014-04-15 16:40:46.978771"], ["user_id", 8]]

  def update
    @resume = Resume.find(params[:id])
    @resume.update_attributes(resume_params)
---
SELECT  "resumes".* FROM "resumes"  WHERE "resumes"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "resumes" SET "section_work" = $1, "updated_at" = $2 WHERE "resumes"."id" = 2  [["section_work", "Internetd"], ["updated_at", "2014-04-15 16:44:31.255599"]]